jimmywong2003/nrf5281x_s113_uart_example/ble_app_uart_s113_libuarte/main.c
static uint16_t m_conn_handle          = BLE_CONN_HANDLE_INVALID;                   /**< Handle of the current connection. */
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;              /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
        {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};




#include "nrf_libuarte_async.h"

NRF_LIBUARTE_ASYNC_DEFINE(libuarte, 0, 2, 0, NRF_LIBUARTE_PERIPHERAL_NOT_USED, 255, 3);

static uint8_t text[] = "UART example started.\r\n Loopback:\r\n";
static uint8_t text_size = sizeof(text);
static volatile bool m_loopback_phase;

typedef struct {
        uint8_t * p_data;
        uint32_t length;
} buffer_t;

static uint8_t uart_buffer[BLE_NUS_MAX_DATA_LEN];
static uint8_t uart_length = 0;

NRF_QUEUE_DEF(buffer_t, m_buf_queue, 10, NRF_QUEUE_MODE_NO_OVERFLOW);

void libuart_event_handler(void * context, nrf_libuarte_async_evt_t * p_evt)
{
        nrf_libuarte_async_t * p_libuarte = (nrf_libuarte_async_t *)context;
        ret_code_t ret, err_code;


        switch (p_evt->type)
        {
        case NRF_LIBUARTE_ASYNC_EVT_ERROR:
                break;
        case NRF_LIBUARTE_ASYNC_EVT_RX_DATA:

                NRF_LOG_INFO("ASYNC RX DATA");
                NRF_LOG_HEXDUMP_INFO(p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);

                uart_length = p_evt->data.rxtx.length;
                memcpy(uart_buffer, p_evt->data.rxtx.p_data, uart_length);

                err_code = ble_nus_data_send(&m_nus, uart_buffer, &uart_length, m_conn_handle);
                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                        APP_ERROR_CHECK(err_code);
                }

#if 0
                ret = nrf_libuarte_async_tx(p_libuarte,p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);
                NRF_LOG_INFO("ASYNC RX DATA");
                NRF_LOG_HEXDUMP_INFO(p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);

                if (ret == NRF_ERROR_BUSY)
                {
                        buffer_t buf = {
                                .p_data = p_evt->data.rxtx.p_data,
                                .length = p_evt->data.rxtx.length,
                        };
                        ret = nrf_queue_push(&m_buf_queue, &buf);
                        APP_ERROR_CHECK(ret);
                }
                else
                {
                        APP_ERROR_CHECK(ret);
                }
                m_loopback_phase = true;
#endif

                break;
        case NRF_LIBUARTE_ASYNC_EVT_TX_DONE:
                if (m_loopback_phase)
                {
                        nrf_libuarte_async_rx_free(p_libuarte, p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);
                        if (!nrf_queue_is_empty(&m_buf_queue))
                        {
                                buffer_t buf;
                                ret = nrf_queue_pop(&m_buf_queue, &buf);
                                APP_ERROR_CHECK(ret);
                                UNUSED_RETURN_VALUE(nrf_libuarte_async_tx(p_libuarte, buf.p_data, buf.length));
                        }
                }
                break;
        default:
                break;
        }
}

/**
 * @brief Function for main application entry.
 */
void libuart_init(void)
{
        ret_code_t err_code;
        nrf_libuarte_async_config_t nrf_libuarte_async_config = {
                .tx_pin     = TX_PIN_NUMBER,
                .rx_pin     = RX_PIN_NUMBER,
                .baudrate   = NRF_UARTE_BAUDRATE_115200,
                .parity     = NRF_UARTE_PARITY_EXCLUDED,
                .hwfc       = NRF_UARTE_HWFC_DISABLED,
                .timeout_us = 100,
                .int_prio   = APP_IRQ_PRIORITY_LOW
        };

        err_code = nrf_libuarte_async_init(&libuarte, &nrf_libuarte_async_config, libuart_event_handler, (void *)&libuarte);

        APP_ERROR_CHECK(err_code);

        nrf_libuarte_async_enable(&libuarte);

}


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
        app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
        uint32_t err_code;
        ble_gap_conn_params_t gap_conn_params;
        ble_gap_conn_sec_mode_t sec_mode;

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                              (const uint8_t *) DEVICE_NAME,
                                              strlen(DEVICE_NAME));
        APP_ERROR_CHECK(err_code);

        memset(&gap_conn_params, 0, sizeof(gap_conn_params));

        gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
        gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
        gap_conn_params.slave_latency     = SLAVE_LATENCY;
        gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

        err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

        if (p_evt->type == BLE_NUS_EVT_RX_DATA)
        {
                uint32_t err_code;

                NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
                NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
                uart_length = p_evt->params.rx_data.length;
                memcpy(uart_buffer, p_evt->params.rx_data.p_data, uart_length);

                err_code = nrf_libuarte_async_tx(&libuarte, uart_buffer, uart_length);
                APP_ERROR_CHECK(err_code);

                // NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
                // NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
                //
                // for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
                // {
                //         do
                //         {
                //                 err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                //                 if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                //                 {
                //                         NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                //                         APP_ERROR_CHECK(err_code);
                //                 }
                //         } while (err_code == NRF_ERROR_BUSY);
                // }
                // if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
                // {
                //         while (app_uart_put('\n') == NRF_ERROR_BUSY);
                // }
        }

